# [Pandas](https://pandas.pydata.org/): Python Data Analysis Library

##### (doesn't quite match up, but it's still a cute nickname!)

<sub>(According to the Wikipedia page on the Pandas library, the name is derived from panel data, but I think we get the point by now)</sub>

## What can it do?

Pandas can:
1. Import data from raw text files (like .csv files), or from Excel files (.xls or .xlsx) into Python
2. Perform data manipulation tasks on this imported data, such as
    1. changing column names, 
    2. selecting specific columns as per our needs, 
    3. slicing the rows into multiple parts, 
    4. changing indices, 
    5. joining or merging data, 
    6. and much more.
3. Export this manipulated data to numpy arrays for numerical and statistical analysis.

In [2]:
import pandas as pd

In [3]:
type(pd)

module

In [4]:
print(pd)

<module 'pandas' from '/home/abhigyan/anaconda3/lib/python3.7/site-packages/pandas/__init__.py'>

# Importing Data - The DataFrame:

##### Trial 1

In [5]:
#ip = pd.read_csv("")
data = pd.read_csv("Zoo.txt",delimiter=',')

Now, what is this `data`? What data type is it and what kind of information does it store? Also, how do we see the data stored in it?

In [6]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

Thus, the basic data type of the Pandas library is the `DataFrame`, which is essentially a table of values, similar to those you get in Excel or other spreadsheet applications.

# Displaying Data
To display the first 5 rows of data, we use `head()`

In [7]:
data.head(50)

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

To display the last 5 rows of data, we use `tail()`

In [8]:
data.tail()

      animal  uniq_id  water_need
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

To display `n` random lines, we use the `sample(n)` function:

In [9]:
data.sample(10)

      animal  uniq_id  water_need
17      lion     1018         500
4      tiger     1005         320
0   elephant     1001         500
18      lion     1019         390
11     zebra     1012         230
19  kangaroo     1020         410
6      tiger     1007         290
12     zebra     1013         220
15      lion     1016         420
7      tiger     1008         310

To display the entire data, we just write the name of our DataFrame object. (Note that it will only show the entire table if it is small enough to be displayed, and we can set that using the `display.max_rows` variable)

In [10]:
data

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [11]:
pd.get_option("display.max_rows")

60

Since our table has only 21 rows, it will show the entire thing at once (since `max_rows = 60`), but as we will see below, when it becomes very large, then the entire table won't be displayed.

Now, we will use another dataset which is considerably larger, and uses a different delimiter:

# Importing more Data

##### Trial 2

In [13]:
data2 = pd.read_csv("pandas_tutorial_read.txt",delimiter=";")

In [ ]:
data2

However, this one doesn't even contain headers... That's an issue, so we will now add those ourselves:

In [ ]:
data2 = pd.read_csv("pandas_tutorial_read.csv", delimiter=";", names=["datetime",'event','country','user_id','source','topic'])

In [ ]:
data2

That looks right...

(Note 2: If you are wondering what’s in this data set – this is the data log of a travel blog taken from [data36.com](https://data36.com/pandas-tutorial-1-basics-reading-data-files-dataframes-data-selection/).)

# Importing Excel Spreadsheets:

This might be a super handy tool for those of you that use Excel spreadsheets a lot, so lets see this once as well:

(I've just saved the same values as those that we had in our `zoo.csv` file, so it's exactly the same thing, but this shows the principle of importing Excel into Python, and now you can try this with your own data as well)

In [ ]:
data3 = pd.read_excel("zoo.xlsx")
data3

# Choosing certain specific columns of your data:

In [ ]:
data2[['user_id','country']]

Note that we need to put this within a double set of brackets. This is because the outer brackets tell python that you wish to select columns, and the inner one is for the actual list of columns that you wish to choose.

So, it is like this:

DataFrame\[list\], where list = \['column1','column2'\].

# Series
Now, we will see another Pandas data type, the `Series`. It is nothing but a one-column table, and it is useful in some cases which we will also come across soon.

If we want a series object instead of a `DataFrame`, we can do it in 2 ways:

`DataFrame.columnName` or `DataFrame['columnName']`

Examples follow below:

In [ ]:
data.animal

In [ ]:
data['animal']

# Filtering out specific rows based on values or other info:

Let’s say, you want to see a list of only the users who came from the ‘SEO’ source. In this case you have to filter for the ‘SEO’ value in the ‘source’ column:

In [ ]:
data2[data2.source=='SEO']

So, how did this work? Let us understand clearly:

What we put inside the brackets is basically going to return a `Series` of boolean values telling us if the `source` column of that row contains `'SEO'` or not:

In [ ]:
data2.source == 'SEO'

Next, when we put this in the brackets, then we choose those rows of the `data2` DataFrame which had returned `True`. Thus, we get the output to be the following 346 rows:

In [ ]:
data2[data2.source=='SEO']

# Chaining functions together:

As with normal Python, we can chain functions together to save memory and code, while compromising a little bit on readability.

Example:

Here we will first choose the first 5 rows and then choose some columns from that:

In [ ]:
data2.head()[['country','user_id','datetime']]

This same thing can also be done as follows: We first choose the columns we want, and then we take the first 5 rows from it. 

The output is exactly the same, another testimony to how everything in python can be done in more than one way

In [ ]:
data2[['country','user_id','datetime']].head()

Now, one task for you all:

### Select the `user_id`, `topic` and `datetime` columns on the topic of North America, and print the last 15 rows only.

Hint for last part:

In [ ]:
data2.head(10)